example01_basic_timed_system/output/symbex_graph_0.puml

@startuml symbex_graph

' // scale 600 width

hide empty description

skinparam linetype polyline
' skinparam linetype ortho
' left to right direction

skinparam backgroundColor White
skinparam backgroundColor White
skinparam noteBorderColor White
skinparam shadowing false
skinparam notefontsize 16
skinparam notefontname Verdana
'skinparam notefontname Consolas
'skinparam noteShadowing false

skinparam state {
	StartColor Green
	EndColor Red

	'Attribut pour les transitions
	ArrowColor Black
	ArrowColor<< Else >> Orange

	'Attribut par défaut pour les états
	BorderColor Gray
	BackgroundColor Wheat

	'Attribut pour les noeuds/feuilles du graphes SymBex
	BackgroundColor<< DefaultNode >> LightBlue

	BackgroundColor<< RedondancyTargetSource >> Green
	BackgroundColor<< RedondancyTargetNode >> GreenYellow

	BackgroundColor<< PassedNode >> GreenYellow
	BackgroundColor<< FailedNode >> Red
	BackgroundColor<< InconclusiveNode >> Orange
	BackgroundColor<< AbortedNode >> Orange
	BackgroundColor<< WarningNode >> Orange
	BackgroundColor<< ErrorNode >> Red
	BackgroundColor<< AlertNode >> Red
	BackgroundColor<< ExitNode >> Red

	'Attribut pour les paths du graphes SymBex
	BackgroundColor<< PassedPath >> LawnGreen
	BackgroundColor<< FailedPath >> Red
	BackgroundColor<< InconclusiveNodePath >> Orange
	BackgroundColor<< AbortedPath >> Red

	FontColor Black
	FontName Times
	FontSize 14
}



state "EC 0" as EC0 << DefaultNode >>

EC0: < ev:1 , h:0 , w:1 > 
EC0: Example01_Basic_Timed_System_S:q0
note left of EC0
$time = 0
	$delay = 0
	_clock_index_ = 0
	cl = 0
	
end note

EC0 -down-> EC1

state "EC 1" as EC1 << PassedPath >>

EC1: < ev:2 , h:1 , w:1 > 
EC1: Example01_Basic_Timed_System_S:q0

EC1 -down-> EC2

EC1 -down-> EC16

state "EC 2" as EC2 << PassedPath >>

EC2: < ev:3 , h:2 , w:1 > 
EC2: Example01_Basic_Timed_System_S:q1
note left of EC2
$time = $delay_1
	$delay = $delay_1
	
end note
EC2: ----
EC2: tpid#1->q0.tr1

EC2 -down-> EC3

EC2 -down-> EC17

state "EC 16" as EC16 << DefaultNode >>

EC16: < ev:0 , h:2 , w:1 > 
EC16: Example01_Basic_Timed_System_S:q0
note left of EC16
$time = $delay_1
	$delay = $delay_1
	
end note
EC16: ----
EC16: QUIESCENCE

state "EC 3" as EC3 << PassedPath >>

EC3: < ev:0 , h:3 , w:1 > 
EC3: Example01_Basic_Timed_System_S:q0
note left of EC3
PC: ($delay_2 <= 5)
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	cl = $delay_2
	
end note
EC3: ----
EC3: tpid#2->q1.tr2

state "EC 17" as EC17 << DefaultNode >>

EC17: < ev:0 , h:3 , w:1 > 
EC17: Example01_Basic_Timed_System_S:q1
note left of EC17
PC: exists< # : urational >(($delay_2 < #) && (# <= 5))
	$time = ($delay_1 + $delay_2)
	$delay = $delay_2
	
end note
EC17: ----
EC17: QUIESCENCE
@enduml
